{
  "project": "DockMon",
  "branchName": "ralph/US-018-system-disk-usage",
  "description": "System Disk Usage and Prune - View disk usage breakdown and clean up unused Docker resources",
  "userStories": [
    {
      "id": "US-018-1",
      "title": "Add system disk usage data structures and Docker API methods",
      "description": "As a developer, I need data structures and API methods to fetch and represent disk usage data from Docker.",
      "acceptanceCriteria": [
        "Create SystemDiskUsage struct with fields for images, containers, volumes, build cache",
        "Each category has total size and reclaimable size",
        "Add df() method to Docker client that calls bollard's system df API",
        "Parse SystemDataUsageResponse from bollard into our SystemDiskUsage struct",
        "Add human-readable formatting for sizes (MB, GB, TB)",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-018-2",
      "title": "Render system tab with disk usage display",
      "description": "As a user, I want to see disk usage breakdown in the System tab so I can understand what's using space.",
      "acceptanceCriteria": [
        "Update System tab rendering to show disk usage section",
        "Display Docker version, API version, OS/Arch, Kernel version",
        "Display Images: total size and reclaimable size",
        "Display Containers: total size and reclaimable size",
        "Display Local Volumes: total size and reclaimable size",
        "Display Build Cache: total size and reclaimable size",
        "Show grand total and total reclaimable",
        "Show reclaimable percentage",
        "Show '[p]Prune unused resources' hint at bottom",
        "Fetch disk usage data when tab is selected",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-018-3",
      "title": "Add prune dialog with checkboxes",
      "description": "As a user, I want a dialog to select which resources to prune before cleaning up.",
      "acceptanceCriteria": [
        "Press 'p' on System tab to open prune dialog",
        "Dialog shows centered popup with checkboxes",
        "Options: Containers (stopped), Images (dangling), Volumes (unused), Networks (unused), Build Cache",
        "'Everything' checkbox that selects/deselects all",
        "Navigate options with ↑/↓ arrow keys",
        "Toggle checkbox with Space or Enter",
        "Confirm with Enter, cancel with Esc or 'q'",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-018-4",
      "title": "Implement prune operations",
      "description": "As a user, I want to actually prune the selected resources and see how much space was reclaimed.",
      "acceptanceCriteria": [
        "Add prune methods to Docker client: prune_containers, prune_images, prune_volumes, prune_networks, prune_build_cache",
        "When prune dialog is confirmed, execute selected prune operations",
        "Show confirmation dialog before executing prune",
        "Show progress/notification during prune",
        "Calculate total reclaimed space from all prune results",
        "Show success notification: 'Reclaimed 2.3 GB'",
        "Refresh disk usage display after prune completes",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-018-5",
      "title": "Update help text with new keybindings",
      "description": "As a user, I need to know about the new System tab keybindings.",
      "acceptanceCriteria": [
        "Add 'System Tab' section to help overlay",
        "Document 'p' key for prune dialog",
        "Update System tab placeholder text to show actual functionality",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    }
  ]
}
